Feature: Вход в системата за резервация за кино прожекция

  Scenario: Резервация за кино прожекция
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Иван"
    And Въвежда фамилия "Петров"
    And Въвежда име на прожекцията "Властелинът на пръстените"
    And Въвежда час на прожекцията "17"
    And Въвежда място в залата "35"
    And Въвежда час на резервацията "13"
    And Натиска бутона за резервация
    Then Вижда съобщение "Успешно направена резервация!".
    
    Scenario: Резервация за кино прожекция с повтарящо място
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Петя"
    And Въвежда фамилия "Димитрова"
    And Въвежда име на прожекцията "Властелинът на пръстените"
    And Въвежда час на прожекцията "15"
    And Въвежда място в залата "30"
    And Въвежда час на резервацията "9"
    And Натиска бутона за резервация
    Then Вижда съобщение "Това място е заето, моля въведете друго място!".
    
    Scenario: Резервация за кино прожекция 60 минути преди самата прожекция
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Иван"
    And Въвежда фамилия " Иванов"
    And Въвежда име на прожекцията "Междузвездни войни"
    And Въвежда час на прожекцията "18"
    And Въвежда място в залата "17"
    And Въвежда час на резервацията "17"
    And Натиска бутона за резервация
    Then Вижда съобщение "Резервация може да се прави не по-късно от 60 мин преди самата прожекция!".
    
    Scenario: Резервация за кино прожекция без въведено име на прожекцията
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Пламен"
    And Въвежда фамилия "Иванов"
    And Въвежда час на прожекцията "15"
    And Въвежда място в залата "8"
    And Въвежда час на резервацията "12"
    And Натиска бутона за резервация
    Then Вижда съобщение "Моля въведете име на прожекция!".
    
    Scenario: Резервация за кино прожекция без въведено място
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Пламен"
    And Въвежда фамилия "Иванов"
    And Въвежда име на прожекцията "Междузвездни войни"
    And Въвежда час на прожекцията "20"
    And Въвежда час на резервацията "11"
    And Натиска бутона за резервация
    Then Вижда съобщение "Моля въведете място!".
    
    Scenario: Резервация за кино прожекция без въведен час на прожекцията
    Given Портебителя отваря екрана за резервация за кино прожекция
    When Въвежда име "Георги"
    And Въвежда име на прожекцията "Междузвездни войни"
    And Въвежда час на прожекцията "14"
    And Въвежда място в залата "19"
    And Въвежда час на резервацията "10"
    And Натиска бутона за резервация
    Then Вижда съобщение "Моля въведете фамилия!".
    